; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=56, out_folder=htg/blocksworld/training, instance_id=36, seed=2060, goal_proportion=0.1

(define (problem blocksworld-36)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on-table b4)
    (clear b28)
    (on-table b28)
    (clear b53)
    (on-table b53)
    (clear b52)
    (on b52 b11)
    (on b11 b21)
    (on b21 b35)
    (on b35 b3)
    (on b3 b43)
    (on b43 b40)
    (on b40 b45)
    (on b45 b34)
    (on-table b34)
    (clear b30)
    (on b30 b8)
    (on-table b8)
    (clear b39)
    (on b39 b16)
    (on b16 b6)
    (on b6 b50)
    (on b50 b13)
    (on b13 b10)
    (on b10 b29)
    (on b29 b56)
    (on b56 b41)
    (on b41 b46)
    (on b46 b47)
    (on b47 b22)
    (on b22 b14)
    (on b14 b7)
    (on b7 b18)
    (on b18 b25)
    (on b25 b9)
    (on b9 b38)
    (on b38 b23)
    (on b23 b12)
    (on b12 b33)
    (on-table b33)
    (clear b20)
    (on b20 b15)
    (on b15 b17)
    (on-table b17)
    (clear b27)
    (on b27 b51)
    (on-table b51)
    (clear b32)
    (on b32 b42)
    (on-table b42)
    (clear b55)
    (on-table b55)
    (clear b26)
    (on-table b26)
    (clear b44)
    (on b44 b49)
    (on-table b49)
    (clear b2)
    (on b2 b36)
    (on b36 b1)
    (on-table b1)
    (clear b31)
    (on-table b31)
    (clear b5)
    (on b5 b24)
    (on b24 b19)
    (on b19 b54)
    (on b54 b48)
    (on-table b48)
    (clear b37)
    (on-table b37))
 (:goal  (and 
    (clear b2)
    (on b2 b5)
    (on-table b5)
    (clear b4)
    (on-table b4)
    (clear b3)
    (on b3 b1)
    (on-table b1))))

; plan
1. (unstack b5 b24)
   deleted: (on b5 b24) (clear b5) (arm-empty)
   added: (holding b5) (clear b24)
   goals met: 4 of 8
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 8
3. (unstack b2 b36)
   deleted: (on b2 b36) (clear b2) (arm-empty)
   added: (holding b2) (clear b36)
   goals met: 4 of 8
4. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 6 of 8
5. (unstack b52 b11)
   deleted: (on b52 b11) (clear b52) (arm-empty)
   added: (holding b52) (clear b11)
   goals met: 6 of 8
6. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 6 of 8
7. (unstack b36 b1)
   deleted: (on b36 b1) (clear b36) (arm-empty)
   added: (holding b36) (clear b1)
   goals met: 6 of 8
8. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 6 of 8
9. (unstack b11 b21)
   deleted: (on b11 b21) (clear b11) (arm-empty)
   added: (holding b11) (clear b21)
   goals met: 6 of 8
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 6 of 8
11. (unstack b21 b35)
   deleted: (on b21 b35) (clear b21) (arm-empty)
   added: (holding b21) (clear b35)
   goals met: 6 of 8
12. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 6 of 8
13. (unstack b35 b3)
   deleted: (on b35 b3) (clear b35) (arm-empty)
   added: (holding b35) (clear b3)
   goals met: 7 of 8
14. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 7 of 8
15. (unstack b3 b43)
   deleted: (on b3 b43) (clear b3) (arm-empty)
   added: (holding b3) (clear b43)
   goals met: 6 of 8
16. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 8 of 8
